In [9]:
import pandas as pd
import numpy as np

Import du fichier

In [10]:
prets = pd.read_csv('https://raw.githubusercontent.com/OpenClassrooms-Student-Center/fr-4452741-decouvrez-les-librairies-python-pour-la-data-science/main/data/prets.csv')

Le taux d’endettement autorisé est de 35 %. Pourriez-vous me communiquer le nombre de personnes ayant dépassé ce seuil ?

Même question, mais cette fois-ci uniquement sur l’agence parisienne.

 Pour faciliter le traitement d’éventuelles futures demandes de prêts, pourriez-vous ajouter une variable nommée risque, qui nous permettrait d’identifier facilement les clients à risque ?

 Combien de prêts automobiles ont été accordés ? Quel est le coût total moyen de ceux-ci ?

 Quel est le bénéfice mensuel total réalisé par l’agence toulousaine ?

In [7]:
prets.head()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014

In [27]:
#par défaut, arrondissement à un chiffre après la virgule
#Création de la variable taux d'endettement
prets["taux_endettement"] = round(prets["remboursement"]/prets["revenu"]*100)
prets.head()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux,taux_endettement
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168,31.0
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701,5.0
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173,24.0
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972,30.0
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014,35.0

In [30]:
prets.loc[prets["taux_endettement"] > 35,:].shape[0]

55

In [33]:
prets.loc[(prets["taux_endettement"] > 35) & (prets["ville"] == "PARIS") ,:].shape[0]

16

In [44]:
prets["risque"] = "NON"
prets.head()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux,taux_endettement,risque
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168,31.0,NON
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701,5.0,NON
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173,24.0,NON
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972,30.0,NON
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014,35.0,NON

In [46]:
prets.loc[prets["taux_endettement"]>35,"risque"] = "OUI"
prets.head()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux,taux_endettement,risque
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168,31.0,NON
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701,5.0,NON
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173,24.0,NON
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972,30.0,NON
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014,35.0,NON

In [52]:
prets_auto = prets.loc[prets["type"]=="automobile",:]
print("il y a",prets_auto.shape[0],"prêts auto accordés")

il y a 16 prêts auto accordés

In [57]:
print("en moyenne, les taux des prêts auto s'élèvent à ",prets_auto["taux"].mean().round(3),"€")

en moyenne, les taux des prêts auto s'élèvent à  3.304 €

In [61]:
rbst_toulouse = prets.loc[prets["ville"]=="TOULOUSE","revenu"].sum()
print(rbst_toulouse)

75617.0

In [70]:
prets.groupby("ville")["remboursement"].sum()

ville
BORDEAUX     15330.59
LYON         26064.67
MARSEILLE    40895.72
NICE         23544.24
PARIS        94052.61
TOULOUSE     19286.18
Name: remboursement, dtype: float64

In [71]:
prets.groupby("ville").agg({"remboursement": ["mean","sum"],
                           "taux": "mean"})

          remboursement                taux
                   mean       sum      mean
ville
BORDEAUX     958.161875  15330.59  1.172937
LYON         930.881071  26064.67  1.389929
MARSEILLE    545.276267  40895.72  1.233840
NICE        1121.154286  23544.24  1.319333
PARIS       1221.462468  94052.61  1.299649
TOULOUSE     714.302963  19286.18  1.415444